OdGeEntity3d.isEqualTo(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns true if the specified entity is equal to this one.
\remarks
Returns true if and only if both entities are of the same type, have the same point set within the
specified tolerance, and have the same parameterization.
\param other [in]  Entity to be compared
\param tol [in]  Geometric tolerance.

OdGeEntity3d.op_Inequality(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity3d object.
\returns
A boolean value that indicates whether the input entity is not identical to this entity.

OdGeEntity3d.op_Equality(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeEntity3d object.
\returns
A boolean value that indicates whether the input entity is identical to this entity.

OdGeEntity3d.op_Assign(OdGeEntity3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the OdGeEntity3d object.